Revit 2016 API
CustomExporter.IncludeFaces Property
 This flag sets the exporter to either include or exclude notifications about faces being processed in the export context.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property has been deprecated starting with Revit 2016. Use the new IncludeGeometricObjects property instead.")]
public bool IncludeFaces { get; set; }
Visual Basic
<ObsoleteAttribute("This property has been deprecated starting with Revit 2016. Use the new IncludeGeometricObjects property instead.")> _
Public Property IncludeFaces As Boolean
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property has been deprecated starting with Revit 2016. Use the new IncludeGeometricObjects property instead.")]
public:
property bool IncludeFaces {
	bool get ();
	void set (bool value);
}
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace